src/com/spotonresponse/RequestCloseSOI.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soap:Body xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<ims:DeleteSOIRequest xmlns:ims="http://uicds.org/SensorService">
<ims:IncidentID xmlns:ims="http://uicds.org/SensorService">{IGID}</ims:IncidentID>
</ims:DeleteSOIRequest>
</soap:Body>
</soap:Envelope>